Revit 2024 API
IConnector Interface
An interface which provides access to connector in Autodesk Revit MEP document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public interface IConnector
Visual Basic
Public Interface IConnector
Visual C++
public interface class IConnector
Remarks
This interface is shared by Connector, ConnectorElement.
See Also
IConnector Members
Autodesk.Revit.DB Namespace